src/InformationRegisters/СтекОповещенийПоВзаимодействиям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтекОповещенийПоВзаимодействиям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНазначеннаяЗадачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СегментИсполнителей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаОповещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектОповещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Взаимодействие</Name>
					<Type>
						<v8:Type>cfg:TaskRef.Взаимодействие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантОповещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНапоминаний</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Уникальное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СотрудникиСегмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СотрудникиСегмента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СоставСегментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СоставСегментов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыСотрудников</v8:Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.СегментыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСегмента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВариантыНапоминаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВариантыНапоминаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЧерезУказанноеВремя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСобытию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВУказанноеВремя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаВремяОтносительноСобытия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПосещению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВМоментСозданияЗадачи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/СтекОповещенийПоВзаимодействиям/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Процедура - Актуализировать стек оповещений
//
// Параметры:
//  ЗадачаОбъект - 	 - 
//
Процедура АктуализироватьСтекОповещений(ЗадачаОбъект) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);	
	СтруктураПараметров.Вставить("ЗадачаОбъект" , Задачи.Взаимодействие.ИнициализироватьРеквизитыВзаимодействия(ЗадачаОбъект));
	СтруктураПараметров.ЗадачаОбъект.Вставить("ДополнительныеСвойства" , Задачи.Взаимодействие.ИнициализироватьДополнительныеСвойстваВзаимодействия(ЗадачаОбъект));
	ПараметрыДлительнойОперации = ЗагрузкаПроведениеДокументов.НачатьАктуализациюСтекаОповещений(Строка(Новый УникальныйИдентификатор()), СтруктураПараметров);

КонецПроцедуры

// Процедура - Удалить оповещения по взаимодействию
//
// Параметры:
//  Взаимодействие	 - 	 - 
//
Процедура УдалитьОповещенияПоВзаимодействию(Взаимодействие) Экспорт 
	
	НачатьТранзакцию();
	Попытка
		НаборЗаписейОповещения = СоздатьНаборЗаписей();
		НаборЗаписейОповещения.Отбор.Взаимодействие.Установить(Взаимодействие);
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.СтекОповещенийПоВзаимодействиям");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Взаимодействие", Взаимодействие);
		БлокировкаДанных.Заблокировать();
		НаборЗаписейОповещения.ОбменДанными.Загрузка = Истина;			
		НаборЗаписейОповещения.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	
КонецПроцедуры

// Функция - Инициализировать стек оповещений взаимодействия
//
// Параметры:
//  ЗадачаОбъект		 - 	 - 
//  ТекущийПользователь	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьСтекОповещенийВзаимодействия(ЗадачаОбъект, ТекущийПользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Сотрудники.Ссылка КАК Сотрудник
	               |ПОМЕСТИТЬ ТаблицаСотрудников
	               |ИЗ
	               |	Справочник.Сотрудники КАК Сотрудники
	               |ГДЕ
	               |	&ИсполнительСотрудник <> НЕОПРЕДЕЛЕНО
	               |	И Сотрудники.Ссылка = &ИсполнительСотрудник
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВЫРАЗИТЬ(СоставСегментов.Сотрудник КАК Справочник.Сотрудники)
	               |ИЗ
	               |	РегистрСведений.СотрудникиСегмента КАК СоставСегментов
	               |ГДЕ
	               |	&ИсполнительСотрудник = НЕОПРЕДЕЛЕНО
	               |	И СоставСегментов.Сегмент = &СегментСотрудников
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НастройкиПользователей.Настройка КАК Настройка,
	               |	НастройкиПользователей.Пользователь КАК Пользователь,
	               |	ВЫРАЗИТЬ(НастройкиПользователей.Значение КАК БУЛЕВО) КАК Значение
	               |ПОМЕСТИТЬ ТаблицаЗначенийНастроекОповещения
	               |ИЗ
	               |	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	               |ГДЕ
	               |	НастройкиПользователей.Настройка В (ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОповещатьПриСозданииЗадач), ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОповещатьОЗапланированныхЗадачах))
	               |	И НастройкиПользователей.Пользователь В
	               |			(ВЫБРАТЬ
	               |				ТаблицаСотрудников.Сотрудник
	               |			ИЗ
	               |				ТаблицаСотрудников)
	               |	И (ВЫРАЗИТЬ(НастройкиПользователей.Значение КАК БУЛЕВО)) = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ТаблицаЗначенийНастроекОповещения.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОповещатьПриСозданииЗадач)
	               |			ТОГДА &ТекущаяДата
	               |		КОГДА ТаблицаЗначенийНастроекОповещения.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОповещатьОЗапланированныхЗадачах)
	               |			ТОГДА &ДатаНазанченная
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ДатаОповещения,
	               |	ТаблицаСотрудников.Сотрудник КАК ОбъектОповещения,
	               |	&Взаимодействие КАК Взаимодействие,
	               |	ВЫБОР
	               |		КОГДА ТаблицаЗначенийНастроекОповещения.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОповещатьПриСозданииЗадач)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыНапоминаний.ВМоментСозданияЗадачи)
	               |		КОГДА ТаблицаЗначенийНастроекОповещения.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОповещатьОЗапланированныхЗадачах)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыНапоминаний.ЗаВремяОтносительноСобытия)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВариантыНапоминаний.ПустаяСсылка)
	               |	КОНЕЦ КАК ВариантОповещения,
	               |	ЛОЖЬ КАК Уникальное,
	               |	&Контрагент КАК Контрагент,
	               |	&ДатаНазанченная КАК ДатаНазначеннаяЗадачи,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(&СегментСотрудников) <> ТИП(Справочник.СегментыСотрудников)
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.СегментыСотрудников.ПустаяСсылка)
	               |		ИНАЧЕ &СегментСотрудников
	               |	КОНЕЦ КАК СегментИсполнителей
	               |ПОМЕСТИТЬ ПланируемыйСтекОповещенийПоВзаимодействиям
	               |ИЗ
	               |	ТаблицаСотрудников КАК ТаблицаСотрудников
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЗначенийНастроекОповещения КАК ТаблицаЗначенийНастроекОповещения
	               |		ПО ТаблицаСотрудников.Сотрудник = ТаблицаЗначенийНастроекОповещения.Пользователь
	               |ГДЕ
	               |	НЕ ТаблицаЗначенийНастроекОповещения.Пользователь ЕСТЬ NULL
	               |	И НЕ ТаблицаЗначенийНастроекОповещения.Настройка ЕСТЬ NULL
	               |	И ВЫБОР
	               |			КОГДА &ЭтоНоваяЗадача
	               |					И &ЭтоРегистрацияТриггером
	               |				ТОГДА ТаблицаЗначенийНастроекОповещения.Настройка В (ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОповещатьПриСозданииЗадач), ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОповещатьОЗапланированныхЗадачах))
	               |			ИНАЧЕ НЕ(ТаблицаЗначенийНастроекОповещения.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОповещатьПриСозданииЗадач)
	               |						И &ТекущийПользователь = &ИсполнительСотрудник)
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СтекОповещенийПоВзаимодействиям.ДатаОповещения КАК ДатаОповещения,
	               |	СтекОповещенийПоВзаимодействиям.ОбъектОповещения КАК ОбъектОповещения,
	               |	СтекОповещенийПоВзаимодействиям.Взаимодействие КАК Взаимодействие,
	               |	СтекОповещенийПоВзаимодействиям.ВариантОповещения КАК ВариантОповещения,
	               |	СтекОповещенийПоВзаимодействиям.Уникальное КАК Уникальное,
	               |	СтекОповещенийПоВзаимодействиям.Контрагент КАК Контрагент,
	               |	СтекОповещенийПоВзаимодействиям.ДатаНазначеннаяЗадачи КАК ДатаНазначеннаяЗадачи,
	               |	СтекОповещенийПоВзаимодействиям.СегментИсполнителей КАК СегментИсполнителей
	               |ПОМЕСТИТЬ ТекущийСтекОповещенийПоВзаимодействиям
	               |ИЗ
	               |	РегистрСведений.СтекОповещенийПоВзаимодействиям КАК СтекОповещенийПоВзаимодействиям
	               |ГДЕ
	               |	СтекОповещенийПоВзаимодействиям.Взаимодействие = &Взаимодействие
	               |	И СтекОповещенийПоВзаимодействиям.ВариантОповещения = ЗНАЧЕНИЕ(Перечисление.ВариантыНапоминаний.ЗаВремяОтносительноСобытия)
	               |	И СтекОповещенийПоВзаимодействиям.Уникальное = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПланируемыйСтекОповещенийПоВзаимодействиям.ДатаОповещения КАК ДатаОповещения,
	               |	ПланируемыйСтекОповещенийПоВзаимодействиям.ОбъектОповещения КАК ОбъектОповещения,
	               |	ПланируемыйСтекОповещенийПоВзаимодействиям.Взаимодействие КАК Взаимодействие,
	               |	ПланируемыйСтекОповещенийПоВзаимодействиям.ВариантОповещения КАК ВариантОповещения,
	               |	ПланируемыйСтекОповещенийПоВзаимодействиям.Уникальное КАК Уникальное,
	               |	ПланируемыйСтекОповещенийПоВзаимодействиям.Контрагент КАК Контрагент,
	               |	ПланируемыйСтекОповещенийПоВзаимодействиям.ДатаНазначеннаяЗадачи КАК ДатаНазначеннаяЗадачи,
	               |	ПланируемыйСтекОповещенийПоВзаимодействиям.СегментИсполнителей КАК СегментИсполнителей
	               |ИЗ
	               |	ПланируемыйСтекОповещенийПоВзаимодействиям КАК ПланируемыйСтекОповещенийПоВзаимодействиям
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТекущийСтекОповещенийПоВзаимодействиям КАК ТекущийСтекОповещенийПоВзаимодействиям
	               |		ПО ПланируемыйСтекОповещенийПоВзаимодействиям.ОбъектОповещения = ТекущийСтекОповещенийПоВзаимодействиям.ОбъектОповещения
	               |ГДЕ
	               |	&УсловиеВыборки
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	&НапоминаниеДатаНачала,
	               |	ТаблицаСотрудников.Сотрудник,
	               |	&Взаимодействие,
	               |	&ВариантНапоминания,
	               |	ИСТИНА,
	               |	&Контрагент,
	               |	&ДатаНазанченная,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(&СегментСотрудников) <> ТИП(Справочник.СегментыСотрудников)
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.СегментыСотрудников.ПустаяСсылка)
	               |		ИНАЧЕ &СегментСотрудников
	               |	КОНЕЦ
	               |ИЗ
	               |	ТаблицаСотрудников КАК ТаблицаСотрудников
	               |ГДЕ
	               |	&НапоминаниеИспользовать
	               |	И &ВариантНапоминания = ЗНАЧЕНИЕ(Перечисление.ВариантыНапоминаний.ЗаВремяОтносительноСобытия)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	&НапоминаниеДатаНачала,
	               |	&ТекущийПользователь,
	               |	&Взаимодействие,
	               |	&ВариантНапоминания,
	               |	ИСТИНА,
	               |	&Контрагент,
	               |	&ДатаНазанченная,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(&СегментСотрудников) <> ТИП(Справочник.СегментыСотрудников)
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.СегментыСотрудников.ПустаяСсылка)
	               |		ИНАЧЕ &СегментСотрудников
	               |	КОНЕЦ
	               |ИЗ
	               |	ТаблицаСотрудников КАК ТаблицаСотрудников
	               |ГДЕ
	               |	&НапоминаниеИспользовать
	               |	И &ВариантНапоминания = ЗНАЧЕНИЕ(Перечисление.ВариантыНапоминаний.ПоПосещению)";				   
	
	Запрос.УстановитьПараметр("ЭтоНоваяЗадача"						, ЗадачаОбъект.ДополнительныеСвойства.Свойство("ОбъектНовый"));
	Запрос.УстановитьПараметр("ЭтоАктуализацияДатОповещенияВСтеке"	, ЗадачаОбъект.ДополнительныеСвойства.Свойство("АктуализироватьДатуОповещенияВСтеке"));
	Запрос.УстановитьПараметр("ЭтоРегистрацияТриггером"				, ЗадачаОбъект.ДополнительныеСвойства.Свойство("ПараметрыРегистрацииТриггера"));
	Если НЕ ЗадачаОбъект.ДополнительныеСвойства.Свойство("ОбъектНовый") Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "НастройкиПользователей.Настройка В (ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОповещатьПриСозданииЗадач), ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОповещатьОЗапланированныхЗадачах))", "НастройкиПользователей.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователей.ОповещатьОЗапланированныхЗадачах)");
		Если ЗадачаОбъект.ДополнительныеСвойства.Свойство("АктуализироватьДатуОповещенияВСтеке") ИЛИ ЗадачаОбъект.ДополнительныеСвойства.Свойство("АктуализироватьИсполнителяВСтеке") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВыборки", "НЕ ТекущийСтекОповещенийПоВзаимодействиям.ОбъектОповещения ЕСТЬ NULL");
		Иначе 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВыборки", "ТекущийСтекОповещенийПоВзаимодействиям.ОбъектОповещения ЕСТЬ NULL");
		КонецЕсли;	
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВыборки", "ТекущийСтекОповещенийПоВзаимодействиям.ОбъектОповещения ЕСТЬ NULL");
	КонецЕсли;	
	Запрос.УстановитьПараметр("ТекущийПользователь"					, ТекущийПользователь);
	Запрос.УстановитьПараметр("ДатаНазанченная"						, ЗадачаОбъект.ЗадачаНазначеннаяДата);
	Запрос.УстановитьПараметр("НапоминаниеИспользовать"				, ЗадачаОбъект.НапоминаниеИспользовать);
	Запрос.УстановитьПараметр("НапоминаниеДатаНачала"				, ЗадачаОбъект.НапоминаниеДатаНачала);
	Запрос.УстановитьПараметр("ВариантНапоминания"					, ЗадачаОбъект.ВариантНапоминания);
	Запрос.УстановитьПараметр("ТекущаяДата"							, ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Взаимодействие"						, ЗадачаОбъект.ЗадачаСсылка);
	Запрос.УстановитьПараметр("Контрагент"							, ЗадачаОбъект.Контрагент);
	Если ТипЗнч(ЗадачаОбъект.Исполнитель) = Тип("СправочникСсылка.Сотрудники") Тогда
		Запрос.УстановитьПараметр("ИсполнительСотрудник"			, ЗадачаОбъект.Исполнитель);
		Запрос.УстановитьПараметр("СегментСотрудников"				, ЗадачаОбъект.Исполнитель);		
	Иначе 
		Запрос.УстановитьПараметр("ИсполнительСотрудник"			, Неопределено);
		Запрос.УстановитьПараметр("СегментСотрудников"				, ЗадачаОбъект.Исполнитель);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция - Инициализировать стек уникальных оповещений взаимодействия
//
// Параметры:
//  ЗадачаОбъект		 - 	 - 
//  ТекущийПользователь	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИнициализироватьСтекУникальныхОповещенийВзаимодействия(ЗадачаОбъект, ТекущийПользователь) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Сотрудники.Ссылка КАК Сотрудник
	               |ПОМЕСТИТЬ ТаблицаСотрудников
	               |ИЗ
	               |	Справочник.Сотрудники КАК Сотрудники
	               |ГДЕ
	               |	&ИсполнительСотрудник <> НЕОПРЕДЕЛЕНО
	               |	И Сотрудники.Ссылка = &ИсполнительСотрудник
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВЫРАЗИТЬ(СоставСегментов.ОбъектСегмента КАК Справочник.Сотрудники)
	               |ИЗ
	               |	РегистрСведений.СоставСегментов КАК СоставСегментов
	               |ГДЕ
	               |	&ИсполнительСотрудник = НЕОПРЕДЕЛЕНО
	               |	И СоставСегментов.Сегмент = &СегментСотрудников
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&НапоминаниеДатаНачала КАК ДатаОповещения,
	               |	ТаблицаСотрудников.Сотрудник КАК ОбъектОповещения,
	               |	&Взаимодействие КАК Взаимодействие,
	               |	&ВариантНапоминания КАК ВариантОповещения,
	               |	ИСТИНА КАК Уникальное,
	               |	&Контрагент КАК Контрагент,
	               |	&ДатаНазанченная КАК ДатаНазначеннаяЗадачи,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(&СегментСотрудников) <> ТИП(Справочник.СегментыСотрудников)
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.СегментыСотрудников.ПустаяСсылка)
	               |		ИНАЧЕ &СегментСотрудников
	               |	КОНЕЦ КАК СегментИсполнителей
	               |ИЗ
	               |	ТаблицаСотрудников КАК ТаблицаСотрудников
	               |ГДЕ
	               |	&НапоминаниеИспользовать
	               |	И &ВариантНапоминания = ЗНАЧЕНИЕ(Перечисление.ВариантыНапоминаний.ЗаВремяОтносительноСобытия)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	&НапоминаниеДатаНачала,
	               |	&ТекущийПользователь,
	               |	&Взаимодействие,
	               |	&ВариантНапоминания,
	               |	ИСТИНА,
	               |	&Контрагент,
	               |	&ДатаНазанченная,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(&СегментСотрудников) <> ТИП(Справочник.СегментыСотрудников)
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.СегментыСотрудников.ПустаяСсылка)
	               |		ИНАЧЕ &СегментСотрудников
	               |	КОНЕЦ
	               |ИЗ
	               |	ТаблицаСотрудников КАК ТаблицаСотрудников
	               |ГДЕ
	               |	&НапоминаниеИспользовать
	               |	И &ВариантНапоминания = ЗНАЧЕНИЕ(Перечисление.ВариантыНапоминаний.ПоПосещению)";				   
	
	Запрос.УстановитьПараметр("ТекущийПользователь"					, ТекущийПользователь);	
	Запрос.УстановитьПараметр("ДатаНазанченная"						, ЗадачаОбъект.ЗадачаНазначеннаяДата);
	Запрос.УстановитьПараметр("НапоминаниеИспользовать"				, ЗадачаОбъект.НапоминаниеИспользовать);
	Запрос.УстановитьПараметр("НапоминаниеДатаНачала"				, ЗадачаОбъект.НапоминаниеДатаНачала);
	Запрос.УстановитьПараметр("ВариантНапоминания"					, ЗадачаОбъект.ВариантНапоминания);
	Запрос.УстановитьПараметр("Взаимодействие"						, ЗадачаОбъект.ЗадачаСсылка);
	Запрос.УстановитьПараметр("Контрагент"							, ЗадачаОбъект.Контрагент);
	Если ТипЗнч(ЗадачаОбъект.Исполнитель) = Тип("СправочникСсылка.Сотрудники") Тогда
		Запрос.УстановитьПараметр("ИсполнительСотрудник"			, ЗадачаОбъект.Исполнитель);
		Запрос.УстановитьПараметр("СегментСотрудников"				, ЗадачаОбъект.Исполнитель);		
	Иначе 
		Запрос.УстановитьПараметр("ИсполнительСотрудник"			, Неопределено);
		Запрос.УстановитьПараметр("СегментСотрудников"				, ЗадачаОбъект.Исполнитель);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция - Получить структуру стека оповещения пользователя
//
// Параметры:
//  ТекущийПользователь	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтруктуруСтекаОповещенияПользователя(ТекущийПользователь = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТекущийПользователь) Тогда 
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	// Получаем закешированные настройки оповещения пользователя
	СтруктураНастроекОповещения = ОбщегоНазначенияПовтИсп.ПолучитьНастройкиОповещенияПользователяПоВзаимодействиям(ТекущийПользователь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтекОповещенийПоВзаимодействиям.ДатаОповещения КАК ДатаОповещения,
	               |	СтекОповещенийПоВзаимодействиям.ОбъектОповещения КАК ОбъектОповещения,
	               |	СтекОповещенийПоВзаимодействиям.Взаимодействие КАК Взаимодействие,
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(СтекОповещенийПоВзаимодействиям.Взаимодействие) КАК ВзаимодействиеПредставление,
	               |	СтекОповещенийПоВзаимодействиям.Взаимодействие.ВерсияДанных КАК ВзаимодействиеВерсияДанных,
	               |	СтекОповещенийПоВзаимодействиям.ВариантОповещения КАК ВариантОповещения,
	               |	СтекОповещенийПоВзаимодействиям.Уникальное КАК Уникальное,
	               |	СтекОповещенийПоВзаимодействиям.Контрагент КАК Контрагент,
	               |	СтекОповещенийПоВзаимодействиям.ДатаНазначеннаяЗадачи КАК ДатаНазначеннаяЗадачи,
	               |	НЕ СтекОповещенийПоВзаимодействиям.ДатаНазначеннаяЗадачи >= НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ) КАК Просрочена,
	               |	ВЫБОР
	               |		КОГДА СтекОповещенийПоВзаимодействиям.ВариантОповещения = ЗНАЧЕНИЕ(Перечисление.ВариантыНапоминаний.ВМоментСозданияЗадачи)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Новая,
	               |	ВЫБОР
	               |		КОГДА СтекОповещенийПоВзаимодействиям.ВариантОповещения = ЗНАЧЕНИЕ(Перечисление.ВариантыНапоминаний.ВМоментСозданияЗадачи)
	               |			ТОГДА &УВасНоваяЗадача
	               |		КОГДА НЕ СтекОповещенийПоВзаимодействиям.ДатаНазначеннаяЗадачи >= НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	               |			ТОГДА &УВасПросроченнаяЗадача
	               |		КОГДА НАЧАЛОПЕРИОДА(СтекОповещенийПоВзаимодействиям.ДатаНазначеннаяЗадачи, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	               |			ТОГДА &УВасНаСегодняЗапланированаЗадача
	               |		ИНАЧЕ &УВасЗапланированаЗадача
	               |	КОНЕЦ КАК ЗаголовокОповещения,
	               |	ВЫБОР
	               |		КОГДА СтекОповещенийПоВзаимодействиям.ВариантОповещения = ЗНАЧЕНИЕ(Перечисление.ВариантыНапоминаний.ВМоментСозданияЗадачи)
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ПолеСортировкиОповещений
	               |ИЗ
	               |	РегистрСведений.СтекОповещенийПоВзаимодействиям КАК СтекОповещенийПоВзаимодействиям
	               |ГДЕ
	               |	СтекОповещенийПоВзаимодействиям.ДатаОповещения <> ДАТАВРЕМЯ(1, 1, 1)
	               |	И СтекОповещенийПоВзаимодействиям.ДатаОповещения < &ТекущаяДата
	               |	И СтекОповещенийПоВзаимодействиям.ДатаОповещения > ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, -1)
	               |	И СтекОповещенийПоВзаимодействиям.ОбъектОповещения = &Исполнитель
	               |	И &УсловиеНастроекОповещения
	               |	И &УсловиеОповещенияПросроченных
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПолеСортировкиОповещений,
	               |	ДатаОповещения,
	               |	Взаимодействие";	
	
	УсловиеНастроекОповещения = "ВЫБОР
	               |			КОГДА СтекОповещенийПоВзаимодействиям.Уникальное
	               |				ТОГДА СтекОповещенийПоВзаимодействиям.ВариантОповещения = ЗНАЧЕНИЕ(Перечисление.ВариантыНапоминаний.ЗаВремяОтносительноСобытия)
	               |			ИНАЧЕ &УсловиеНастроекОповещения
	               |		КОНЕЦ";
	
	Если СтруктураНастроекОповещения.ОповещатьПриСозданииЗадач И СтруктураНастроекОповещения.ОповещатьОЗапланированныхЗадачах Тогда 
		УсловиеНастроекОповещения = СтрЗаменить(УсловиеНастроекОповещения, "&УсловиеНастроекОповещения", "СтекОповещенийПоВзаимодействиям.ВариантОповещения В (ЗНАЧЕНИЕ(Перечисление.ВариантыНапоминаний.ВМоментСозданияЗадачи), ЗНАЧЕНИЕ(Перечисление.ВариантыНапоминаний.ЗаВремяОтносительноСобытия))");
	ИначеЕсли СтруктураНастроекОповещения.ОповещатьПриСозданииЗадач Тогда 
		УсловиеНастроекОповещения = СтрЗаменить(УсловиеНастроекОповещения, "&УсловиеНастроекОповещения", "СтекОповещенийПоВзаимодействиям.ВариантОповещения = ЗНАЧЕНИЕ(Перечисление.ВариантыНапоминаний.ВМоментСозданияЗадачи)");
	ИначеЕсли СтруктураНастроекОповещения.ОповещатьОЗапланированныхЗадачах Тогда 
		УсловиеНастроекОповещения = "СтекОповещенийПоВзаимодействиям.ВариантОповещения = ЗНАЧЕНИЕ(Перечисление.ВариантыНапоминаний.ЗаВремяОтносительноСобытия)";
	Иначе 
		УсловиеНастроекОповещения = "СтекОповещенийПоВзаимодействиям.ВариантОповещения = ЗНАЧЕНИЕ(Перечисление.ВариантыНапоминаний.ЗаВремяОтносительноСобытия)
	               |	И СтекОповещенийПоВзаимодействиям.Уникальное = ИСТИНА";
	КонецЕсли;	
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНастроекОповещения", УсловиеНастроекОповещения);	
	
	Если СтруктураНастроекОповещения.НеОповещатьОПросроченныхЗадачах Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОповещенияПросроченных", "ВЫБОР
	               |			КОГДА СтекОповещенийПоВзаимодействиям.Уникальное
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ СтекОповещенийПоВзаимодействиям.ДатаНазначеннаяЗадачи >= НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	               |		КОНЕЦ");	
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОповещенияПросроченных", "ИСТИНА");	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Исполнитель"						,ТекущийПользователь.Сотрудник);
	Запрос.УстановитьПараметр("ТекущаяДата"						,ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("УВасНоваяЗадача"					,НСтр("ru='У Вас новая задача';en='You have a new task'"));
	Запрос.УстановитьПараметр("УВасНаСегодняЗапланированаЗадача",НСтр("ru='У Вас на сегодня запланирована задача';en='You have a task planned for today'"));
	Запрос.УстановитьПараметр("УВасПросроченнаяЗадача"			,НСтр("ru='У Вас просроченная задача';en='You have an expired task'"));
	Запрос.УстановитьПараметр("УВасЗапланированаЗадача"			,НСтр("ru='У Вас запланирована задача';en='You have a scheduled task'"));
	
	ТаблицаОповещений = Запрос.Выполнить().Выгрузить();
	
	// Подготовим структуру стека
	СтруктураСтекаОповещения = Новый Структура;
	СтруктураСтекаОповещения.Вставить("МассивВзаимодействийДляУникальныхОповещений"		, Новый Массив);
	СтруктураСтекаОповещения.Вставить("МассивВзаимодействийДляНеУникальныхОповещений"	, Новый Массив);
	
	Если ТаблицаОповещений.Количество() > 0 Тогда 
		ТаблицаУникальныхОповещений 	= ТаблицаОповещений.Скопировать(Новый Структура("Уникальное", Истина));
		ТаблицаНеУникальныхОповещений 	= ТаблицаОповещений.Скопировать(Новый Структура("Уникальное", Ложь));
		//ТаблицаУникальныхОповещений.Свернуть("Взаимодействие");
		Для Каждого СтрокаТЗ Из ТаблицаУникальныхОповещений Цикл 
			Если ЗначениеЗаполнено(СтрокаТЗ.ВзаимодействиеВерсияДанных) Тогда 
				Если СтруктураСтекаОповещения.МассивВзаимодействийДляУникальныхОповещений.Найти(СтрокаТЗ.Взаимодействие) = Неопределено Тогда 
					СтруктураСтекаОповещения.МассивВзаимодействийДляУникальныхОповещений.Добавить(СтрокаТЗ.Взаимодействие);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
		//СтруктураСтекаОповещения.Вставить("МассивВзаимодействийДляУникальныхОповещений", ТаблицаУникальныхОповещений.ВыгрузитьКолонку("Взаимодействие"));
		
		Если ТаблицаНеУникальныхОповещений.Количество() > 0 Тогда
			КоллекцияКолонок = ТаблицаНеУникальныхОповещений.Колонки;
			МассивПеренесенныхОповещений = Новый Массив;
			Для Каждого СтрокаОповещение Из ТаблицаНеУникальныхОповещений Цикл 
				СтруктураОповещения = Новый Структура;
				Если СтрокаОповещение.ВариантОповещения = Перечисления.ВариантыНапоминаний.ВМоментСозданияЗадачи Тогда 
					МассивЗапланированных = ТаблицаНеУникальныхОповещений.НайтиСтроки(Новый Структура("Взаимодействие, ВариантОповещения", СтрокаОповещение.Взаимодействие, Перечисления.ВариантыНапоминаний.ЗаВремяОтносительноСобытия));
					Если МассивЗапланированных.Количество() > 0 Тогда 
						Если МассивЗапланированных[0].ДатаОповещения < ТекущаяДатаСеанса() + 3600 Тогда 
							ПеренестиОповещениеНаСледующийДень(МассивЗапланированных[0]);
							МассивПеренесенныхОповещений.Добавить(МассивЗапланированных[0]);
						КонецЕсли;
					КонецЕсли;
					Для Каждого КолонкаОповещения Из КоллекцияКолонок Цикл 
						СтруктураОповещения.Вставить(КолонкаОповещения.Имя, СтрокаОповещение[КолонкаОповещения.Имя]);
					КонецЦикла;
					СтруктураОповещения.Вставить("НавигационнаяСсылка"	, ПолучитьНавигационнуюСсылку(СтруктураОповещения.Взаимодействие));
					СтруктураОповещения.Вставить("КлючУникальности"		, "Новая_" + XMLСтрока(СтруктураОповещения.Взаимодействие));
					
					СтруктураСтекаОповещения.МассивВзаимодействийДляНеУникальныхОповещений.Добавить(СтруктураОповещения);
					УдалитьОповещениеИзСтека(СтруктураОповещения);
				ИначеЕсли СтрокаОповещение.ВариантОповещения = Перечисления.ВариантыНапоминаний.ЗаВремяОтносительноСобытия Тогда
					Если МассивПеренесенныхОповещений.Найти(СтрокаОповещение) = Неопределено Тогда 
						Для Каждого КолонкаОповещения Из КоллекцияКолонок Цикл 
							СтруктураОповещения.Вставить(КолонкаОповещения.Имя, СтрокаОповещение[КолонкаОповещения.Имя]);
						КонецЦикла;
						СтруктураОповещения.Вставить("НавигационнаяСсылка"	, ПолучитьНавигационнуюСсылку(СтруктураОповещения.Взаимодействие));
						СтруктураОповещения.Вставить("КлючУникальности"		, "Запланированная_" + XMLСтрока(СтруктураОповещения.Взаимодействие));
						
						СтруктураСтекаОповещения.МассивВзаимодействийДляНеУникальныхОповещений.Добавить(СтруктураОповещения);
						ПеренестиОповещениеНаСледующийДень(СтрокаОповещение);						
					КонецЕсли;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат СтруктураСтекаОповещения;
	
КонецФункции

// Функция - Получить текущие задачи для оповещения пользователя по посещению клиента
//
// Параметры:
//  Клиент		 - 	 - 
//  Пользователь - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьТекущиеЗадачиДляОповещенияПользователяПоПосещениюКлиента(Клиент, Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтекОповещенийПоВзаимодействиям.Взаимодействие КАК Взаимодействие
	               |ИЗ
	               |	РегистрСведений.СтекОповещенийПоВзаимодействиям КАК СтекОповещенийПоВзаимодействиям
	               |ГДЕ
	               |	СтекОповещенийПоВзаимодействиям.ВариантОповещения = ЗНАЧЕНИЕ(Перечисление.ВариантыНапоминаний.ПоПосещению)
	               |	И СтекОповещенийПоВзаимодействиям.Контрагент = &Клиент
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СтекОповещенийПоВзаимодействиям.ДатаОповещения,
	               |	Взаимодействие";	
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Взаимодействие");
	
КонецФункции

// Процедура - Перенести оповещение на следующий день
//
// Параметры:
//  СтруктураОповещения	 - 	 - 
//
Процедура ПеренестиОповещениеНаСледующийДень(СтруктураОповещения) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураОповещения);
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.ДатаОповещения = (НачалоДня(ТекущаяДатаСеанса()) + 24*3600) + ((Час(СтруктураОповещения.ДатаОповещения) * 3600) + (Минута(СтруктураОповещения.ДатаОповещения) * 60));
	МенеджерЗаписи.Записать();
	
КонецПроцедуры	

// Процедура - Удалить оповещение из стека
//
// Параметры:
//  СтруктураОповещения	 - 	 - 
//
Процедура УдалитьОповещениеИзСтека(СтруктураОповещения) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураОповещения);
	МенеджерЗаписи.Удалить();
	
КонецПроцедуры	

// Процедура - Актуализировать исполнителей в стеке оповещений
//
// Параметры:
//  СегментСотрудников	 - 	 - 
//
Процедура АктуализироватьИсполнителейВСтекеОповещений(СегментСотрудников) Экспорт 
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтекОповещенийПоВзаимодействиям.ОбъектОповещения КАК ОбъектОповещения,
	               |	СтекОповещенийПоВзаимодействиям.СегментИсполнителей КАК СегментИсполнителей
	               |ИЗ
	               |	РегистрСведений.СтекОповещенийПоВзаимодействиям КАК СтекОповещенийПоВзаимодействиям
	               |ГДЕ
	               |	СтекОповещенийПоВзаимодействиям.ВариантОповещения = ЗНАЧЕНИЕ(Перечисление.ВариантыНапоминаний.ЗаВремяОтносительноСобытия)
	               |	И СтекОповещенийПоВзаимодействиям.Уникальное = ИСТИНА
	               |	И СтекОповещенийПоВзаимодействиям.СегментИсполнителей = &СегментСотрудников";
	
	Запрос.УстановитьПараметр("СегментСотрудников", СегментСотрудников);
	
	Если Запрос.Выполнить().Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтекОповещенийПоВзаимодействиям.ДатаОповещения КАК ДатаОповещения,
	               |	СтекОповещенийПоВзаимодействиям.ОбъектОповещения КАК ОбъектОповещения,
	               |	СтекОповещенийПоВзаимодействиям.Взаимодействие КАК Взаимодействие,
	               |	СтекОповещенийПоВзаимодействиям.ВариантОповещения КАК ВариантОповещения,
	               |	СтекОповещенийПоВзаимодействиям.Уникальное КАК Уникальное,
	               |	СтекОповещенийПоВзаимодействиям.Контрагент КАК Контрагент,
	               |	СтекОповещенийПоВзаимодействиям.ДатаНазначеннаяЗадачи КАК ДатаНазначеннаяЗадачи,
	               |	СтекОповещенийПоВзаимодействиям.СегментИсполнителей КАК СегментИсполнителей
	               |ПОМЕСТИТЬ ТаблицаСтекОповещений
	               |ИЗ
	               |	РегистрСведений.СтекОповещенийПоВзаимодействиям КАК СтекОповещенийПоВзаимодействиям
	               |ГДЕ
	               |	СтекОповещенийПоВзаимодействиям.ВариантОповещения = ЗНАЧЕНИЕ(Перечисление.ВариантыНапоминаний.ЗаВремяОтносительноСобытия)
	               |	И СтекОповещенийПоВзаимодействиям.Уникальное = ИСТИНА
	               |	И СтекОповещенийПоВзаимодействиям.СегментИсполнителей = &СегментСотрудников
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВЫРАЗИТЬ(СоставСегментов.ОбъектСегмента КАК Справочник.Сотрудники) КАК Сотрудник
	               |ПОМЕСТИТЬ ТаблицаСотрудниковВСегменте
	               |ИЗ
	               |	РегистрСведений.СоставСегментов КАК СоставСегментов
	               |ГДЕ
	               |	СоставСегментов.Сегмент = &СегментСотрудников
	               |	И НЕ ВЫРАЗИТЬ(СоставСегментов.ОбъектСегмента КАК Справочник.Сотрудники) ЕСТЬ NULL
	               |	И НЕ (ВЫРАЗИТЬ(СоставСегментов.ОбъектСегмента КАК Справочник.Сотрудники)) = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ТаблицаСтекОповещений.ОбъектОповещения ЕСТЬ NULL
	               |			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	               |		ИНАЧЕ ТаблицаСтекОповещений.ДатаОповещения
	               |	КОНЕЦ КАК ДатаОповещения,
	               |	ВЫБОР
	               |		КОГДА ТаблицаСтекОповещений.ОбъектОповещения ЕСТЬ NULL
	               |			ТОГДА ТаблицаСотрудниковВСегменте.Сотрудник
	               |		ИНАЧЕ ТаблицаСтекОповещений.ОбъектОповещения
	               |	КОНЕЦ КАК ОбъектОповещения,
	               |	ВЫБОР
	               |		КОГДА ТаблицаСтекОповещений.ОбъектОповещения ЕСТЬ NULL
	               |			ТОГДА ЗНАЧЕНИЕ(Задача.Взаимодействие.ПустаяСсылка)
	               |		ИНАЧЕ ТаблицаСтекОповещений.Взаимодействие
	               |	КОНЕЦ КАК Взаимодействие,
	               |	ВЫБОР
	               |		КОГДА ТаблицаСтекОповещений.ОбъектОповещения ЕСТЬ NULL
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыНапоминаний.ПустаяСсылка)
	               |		ИНАЧЕ ТаблицаСтекОповещений.ВариантОповещения
	               |	КОНЕЦ КАК ВариантОповещения,
	               |	ИСТИНА КАК Уникальное,
	               |	ВЫБОР
	               |		КОГДА ТаблицаСтекОповещений.ОбъектОповещения ЕСТЬ NULL
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |		ИНАЧЕ ТаблицаСтекОповещений.Контрагент
	               |	КОНЕЦ КАК Контрагент,
	               |	ВЫБОР
	               |		КОГДА ТаблицаСтекОповещений.ОбъектОповещения ЕСТЬ NULL
	               |			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	               |		ИНАЧЕ ТаблицаСтекОповещений.ДатаНазначеннаяЗадачи
	               |	КОНЕЦ КАК ДатаНазначеннаяЗадачи,
	               |	&СегментСотрудников КАК СегментИсполнителей,
	               |	ВЫБОР
	               |		КОГДА ТаблицаСтекОповещений.ОбъектОповещения ЕСТЬ NULL
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ДобавитьВСтек,
	               |	ВЫБОР
	               |		КОГДА ТаблицаСотрудниковВСегменте.Сотрудник ЕСТЬ NULL
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК УдалитьИзСтека
	               |ПОМЕСТИТЬ ИтоговаяТаблица
	               |ИЗ
	               |	ТаблицаСтекОповещений КАК ТаблицаСтекОповещений
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ТаблицаСотрудниковВСегменте КАК ТаблицаСотрудниковВСегменте
	               |		ПО ТаблицаСтекОповещений.ОбъектОповещения = ТаблицаСотрудниковВСегменте.Сотрудник
	               |ГДЕ
	               |	(ТаблицаСтекОповещений.ОбъектОповещения ЕСТЬ NULL
	               |			ИЛИ ТаблицаСотрудниковВСегменте.Сотрудник ЕСТЬ NULL)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИтоговаяТаблица.ДатаОповещения КАК ДатаОповещения,
	               |	ИтоговаяТаблица.ОбъектОповещения КАК ОбъектОповещения,
	               |	ИтоговаяТаблица.Взаимодействие КАК Взаимодействие,
	               |	ИтоговаяТаблица.ВариантОповещения КАК ВариантОповещения,
	               |	ИтоговаяТаблица.Уникальное КАК Уникальное,
	               |	ИтоговаяТаблица.Контрагент КАК Контрагент,
	               |	ИтоговаяТаблица.ДатаНазначеннаяЗадачи КАК ДатаНазначеннаяЗадачи,
	               |	ИтоговаяТаблица.СегментИсполнителей КАК СегментИсполнителей,
	               |	ИтоговаяТаблица.ДобавитьВСтек КАК ДобавитьВСтек,
	               |	ИтоговаяТаблица.УдалитьИзСтека КАК УдалитьИзСтека
	               |ИЗ
	               |	ИтоговаяТаблица КАК ИтоговаяТаблица
	               |ГДЕ
	               |	ИтоговаяТаблица.УдалитьИзСтека = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаСтекОповещений.ДатаОповещения КАК ДатаОповещения,
	               |	ИтоговаяТаблица.ОбъектОповещения КАК ОбъектОповещения,
	               |	ТаблицаСтекОповещений.Взаимодействие КАК Взаимодействие,
	               |	ТаблицаСтекОповещений.ВариантОповещения КАК ВариантОповещения,
	               |	ТаблицаСтекОповещений.Уникальное КАК Уникальное,
	               |	ТаблицаСтекОповещений.Контрагент КАК Контрагент,
	               |	ТаблицаСтекОповещений.ДатаНазначеннаяЗадачи КАК ДатаНазначеннаяЗадачи,
	               |	ТаблицаСтекОповещений.СегментИсполнителей КАК СегментИсполнителей,
	               |	ИтоговаяТаблица.ДобавитьВСтек КАК ДобавитьВСтек,
	               |	ИтоговаяТаблица.УдалитьИзСтека КАК УдалитьИзСтека
	               |ИЗ
	               |	ИтоговаяТаблица КАК ИтоговаяТаблица
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСтекОповещений КАК ТаблицаСтекОповещений
	               |		ПО ИтоговаяТаблица.ОбъектОповещения <> ТаблицаСтекОповещений.ОбъектОповещения
	               |ГДЕ
	               |	ИтоговаяТаблица.ДобавитьВСтек = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаСтекОповещений.ДатаОповещения,
	               |	ИтоговаяТаблица.ОбъектОповещения,
	               |	ТаблицаСтекОповещений.Взаимодействие,
	               |	ТаблицаСтекОповещений.ВариантОповещения,
	               |	ТаблицаСтекОповещений.Уникальное,
	               |	ТаблицаСтекОповещений.Контрагент,
	               |	ТаблицаСтекОповещений.ДатаНазначеннаяЗадачи,
	               |	ТаблицаСтекОповещений.СегментИсполнителей,
	               |	ИтоговаяТаблица.ДобавитьВСтек,
	               |	ИтоговаяТаблица.УдалитьИзСтека";
	
	Запрос.УстановитьПараметр("СегментСотрудников", СегментСотрудников);
	
	ПакетТаблицРезультата 	= Запрос.ВыполнитьПакет();
	ТаблицаУдаляемыхИзСтека = ПакетТаблицРезультата[3].Выгрузить();
	ТаблицаДобавляемыхВСтек = ПакетТаблицРезультата[4].Выгрузить();
	
	// Удаляем не актуальных сотрудников
	Для Каждого СтрокаУдаляемый Из ТаблицаУдаляемыхИзСтека Цикл 
		МенеджерЗаписиОповещений = РегистрыСведений.СтекОповещенийПоВзаимодействиям.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписиОповещений, СтрокаУдаляемый);
		Попытка
			МенеджерЗаписиОповещений.Удалить();
		Исключение
			
		КонецПопытки;	
	КонецЦикла;
	
	// Добавляем не актуальных сотрудников	
	Для Каждого СтрокаДобавляемый Из ТаблицаДобавляемыхВСтек Цикл 
		МенеджерЗаписиОповещений = РегистрыСведений.СтекОповещенийПоВзаимодействиям.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписиОповещений, СтрокаДобавляемый);
		Попытка
			МенеджерЗаписиОповещений.Записать();
		Исключение
			
		КонецПопытки;	
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти
